Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.help.mosh
source: Usage: cmux mosh <destination> [flags] [-- <remote-command-args>] Mosh terminal transport: --transport <ssh|mosh> Interactive terminal transport (default: mosh) SSH continues to handle remote features; Mosh carries only the interactive terminal. If Mosh is missing locally or remotely, cmux reports it and uses SSH. Example: cmux ssh dev@my-host --transport mosh cmux mosh dev@my-host
ar: الاستخدام: cmux mosh <destination> [flags] [-- <remote-command-args>] وسيلة نقل الطرفية Mosh: --transport <ssh|mosh> وسيلة نقل الطرفية التفاعلية (الافتراضي: mosh) يستمر SSH في التعامل مع الميزات البعيدة؛ وينقل Mosh الطرفية التفاعلية فقط. إذا كان Mosh مفقودًا محليًا أو عن بُعد، يقوم cmux بالإبلاغ عن ذلك ويستخدم SSH. مثال: cmux ssh dev@my-host --transport mosh cmux mosh dev@my-host
bs: Upotreba: cmux mosh <destination> [flags] [-- <remote-command-args>] Mosh transport terminala: --transport <ssh|mosh> Transport interaktivnog terminala (zadano: mosh) SSH upravlja udaljenim funkcijama, a Mosh prenosi samo terminal. Ako Mosh nedostaje lokalno ili udaljeno, cmux to prijavljuje i koristi SSH. Primjer: cmux ssh dev@my-host --transport mosh cmux mosh dev@my-host
da: Brug: cmux mosh <destination> [flags] [-- <remote-command-args>] Mosh-terminaltransport: --transport <ssh|mosh> Interaktiv terminaltransport (standard: mosh) SSH håndterer fjernfunktioner, og Mosh bærer kun terminalen. Hvis Mosh mangler lokalt eller på fjernværten, oplyser cmux det og bruger SSH. Eksempel: cmux ssh dev@my-host --transport mosh cmux mosh dev@my-host
de: Verwendung: cmux mosh <destination> [flags] [-- <remote-command-args>] Mosh-Terminaltransport: --transport <ssh|mosh> Interaktiver Terminaltransport (Standard: mosh) SSH übernimmt weiterhin Remote-Funktionen; Mosh überträgt nur das interaktive Terminal. Wenn Mosh lokal oder remote fehlt, meldet cmux dies und verwendet SSH. Beispiel: cmux ssh dev@my-host --transport mosh cmux mosh dev@my-host
es: Uso: cmux mosh <destination> [flags] [-- <remote-command-args>] Transporte de terminal Mosh: --transport <ssh|mosh> Transporte de terminal interactivo (por defecto: mosh) SSH continúa manejando las funciones remotas; Mosh transporta únicamente la terminal interactiva. Si Mosh no está disponible de forma local o remota, cmux lo informa y usa SSH. Ejemplo: cmux ssh dev@my-host --transport mosh cmux mosh dev@my-host
fr: Utilisation : cmux mosh <destination> [options] [-- <remote-command-args>] Transport de terminal Mosh : --transport <ssh|mosh> Transport de terminal interactif (par défaut : mosh) SSH continue de gérer les fonctionnalités distantes ; Mosh ne prend en charge que le terminal interactif. Si Mosh est manquant localement ou à distance, cmux le signale et utilise SSH. Exemple : cmux ssh dev@my-host --transport mosh cmux mosh dev@my-host
it: Utilizzo: cmux mosh <destination> [flags] [-- <remote-command-args>] Trasporto terminale Mosh: --transport <ssh|mosh> Trasporto del terminale interattivo (predefinito: mosh) SSH gestisce le funzioni remote e Mosh trasporta solo il terminale. Se Mosh manca in locale o in remoto, cmux lo segnala e usa SSH. Esempio: cmux ssh dev@my-host --transport mosh cmux mosh dev@my-host
ja: 使用方法: cmux mosh <destination> [flags] [-- <remote-command-args>] Mosh ターミナル転送: --transport <ssh|mosh> インタラクティブなターミナル転送（デフォルト: mosh） リモート機能は引き続き SSH が処理し、Mosh はインタラクティブな ターミナルのみを転送します。ローカルまたはリモートに Mosh がない場合、cmux はそれを報告して SSH を使用します。 例: cmux ssh dev@my-host --transport mosh cmux mosh dev@my-host
ko: 사용법: cmux mosh <destination> [flags] [-- <remote-command-args>] Mosh 터미널 전송: --transport <ssh|mosh> 대화형 터미널 전송 (기본값: mosh) SSH는 원격 기능을 계속 처리하며, Mosh는 대화형 터미널 전송만 담당합니다. 로컬 또는 원격에 Mosh가 없는 경우 cmux가 이를 보고하고 SSH를 사용합니다. 예시: cmux ssh dev@my-host --transport mosh cmux mosh dev@my-host
nb: Bruk: cmux mosh <destination> [flags] [-- <remote-command-args>] Mosh-terminaltransport: --transport <ssh|mosh> Interaktiv terminaltransport (standard: mosh) SSH håndterer eksterne funksjoner, og Mosh bærer bare terminalen. Hvis Mosh mangler lokalt eller eksternt, sier cmux fra og bruker SSH. Eksempel: cmux ssh dev@my-host --transport mosh cmux mosh dev@my-host
pl: Użycie: cmux mosh <destination> [flags] [-- <remote-command-args>] Transport terminala Mosh: --transport <ssh|mosh> Transport terminala interaktywnego (domyślnie: mosh) SSH obsługuje funkcje zdalne, a Mosh tylko terminal. Jeśli brakuje Mosh lokalnie lub zdalnie, cmux informuje o tym i używa SSH. Przykład: cmux ssh dev@my-host --transport mosh cmux mosh dev@my-host
pt_br: Uso: cmux mosh <destination> [flags] [-- <remote-command-args>] Transporte de terminal Mosh: --transport <ssh|mosh> Transporte do terminal interativo (padrão: mosh) O SSH gerencia os recursos remotos e o Mosh transporta apenas o terminal. Se faltar Mosh local ou remotamente, o cmux informa e usa SSH. Exemplo: cmux ssh dev@my-host --transport mosh cmux mosh dev@my-host
ru: Использование: cmux mosh <destination> [flags] [-- <remote-command-args>] Транспорт терминала Mosh: --transport <ssh|mosh> Транспорт интерактивного терминала (по умолчанию: mosh) SSH управляет удалёнными функциями, а Mosh передаёт только терминал. Если Mosh отсутствует локально или удалённо, cmux сообщает об этом и использует SSH. Пример: cmux ssh dev@my-host --transport mosh cmux mosh dev@my-host
th: การใช้งาน: cmux mosh <destination> [flags] [-- <remote-command-args>] การส่งเทอร์มินัล Mosh: --transport <ssh|mosh> การส่งเทอร์มินัลแบบโต้ตอบ (ค่าเริ่มต้น: mosh) SSH จัดการคุณสมบัติระยะไกล ส่วน Mosh ส่งเฉพาะเทอร์มินัล หากไม่มี Mosh ในเครื่องหรือบนโฮสต์ระยะไกล cmux จะแจ้งและใช้ SSH ตัวอย่าง: cmux ssh dev@my-host --transport mosh cmux mosh dev@my-host
tr: Kullanım: cmux mosh <destination> [flags] [-- <remote-command-args>] Mosh terminal aktarımı: --transport <ssh|mosh> Etkileşimli terminal aktarımı (varsayılan: mosh) Uzak özellikleri SSH yönetir, Mosh yalnızca terminali taşır. Mosh yerelde veya uzakta yoksa cmux bunu bildirir ve SSH kullanır. Örnek: cmux ssh dev@my-host --transport mosh cmux mosh dev@my-host
uk: Використання: cmux mosh <destination> [flags] [-- <remote-command-args>] Транспорт термінала Mosh: --transport <ssh|mosh> Транспорт інтерактивного термінала (типово: mosh) SSH керує віддаленими функціями, а Mosh передає лише термінал. Якщо Mosh відсутній локально або віддалено, cmux повідомляє про це й використовує SSH. Приклад: cmux ssh dev@my-host --transport mosh cmux mosh dev@my-host
zh_hans: 用法: cmux mosh <destination> [flags] [-- <remote-command-args>] Mosh 终端传输： --transport <ssh|mosh> 交互式终端传输（默认：mosh） SSH 继续处理远程功能；Mosh 仅承载交互式 终端。如果本地或远程缺少 Mosh，cmux 会进行报告并使用 SSH。 示例： cmux ssh dev@my-host --transport mosh cmux mosh dev@my-host
zh_hant: 用法：cmux mosh <destination> [flags] [-- <remote-command-args>] Mosh 終端機傳輸： --transport <ssh|mosh> 互動式終端機傳輸 (預設值：mosh) SSH 將繼續處理遠端功能；Mosh 僅載送互動式 終端機。如果本地或遠端缺少 Mosh，cmux 會回報並使用 SSH。 範例： cmux ssh dev@my-host --transport mosh cmux mosh dev@my-host

# cli.help.mosh-tmux
source: Usage: cmux mosh-tmux <destination> [--session <name>] [flags] Create a Mosh workspace that creates or attaches to a named tmux session (default: main). The tmux profile persists across reconnect and app session restore. This is a roaming tmux terminal, not the native mirror from cmux ssh-tmux. --session <name> selects the session; all other flags match cmux mosh. Without Mosh, the same profile runs over SSH. Example: cmux mosh-tmux dev@my-host cmux mosh-tmux dev@my-host --session agent-main
ar: الاستخدام: cmux mosh-tmux <destination> [--session <name>] [flags] أنشئ مساحة عمل Mosh تُنشئ جلسة tmux مسماة أو تتصل بها (الافتراضي: main). يستمر ملف تعريف tmux بعد إعادة الاتصال واستعادة جلسة التطبيق. هذه طرفية tmux متجولة وليست مرآة cmux ssh-tmux الأصلية. يحدد --session <name> الجلسة، وتطابق بقية الخيارات cmux mosh. عند غياب Mosh يعمل ملف tmux نفسه عبر SSH. مثال: cmux mosh-tmux dev@my-host cmux mosh-tmux dev@my-host --session agent-main
bs: Upotreba: cmux mosh-tmux <destination> [--session <name>] [flags] Kreirajte Mosh workspace koji kreira ili spaja imenovanu tmux sesiju (zadano: main). Tmux profil opstaje kroz ponovno povezivanje i vraćanje sesije aplikacije. Ovo je roaming tmux terminal, a ne izvorni mirror iz cmux ssh-tmux. --session <name> bira sesiju; ostale opcije odgovaraju cmux mosh. Bez Mosha isti profil radi preko SSH-a. Primjer: cmux mosh-tmux dev@my-host cmux mosh-tmux dev@my-host --session agent-main
da: Brug: cmux mosh-tmux <destination> [--session <name>] [flags] Opret et Mosh-arbejdsområde, der opretter eller tilslutter en navngivet tmux-session (standard: main). Tmux-profilen bevares ved genoprettelse og app-sessionsgendannelse. Dette er en roaming tmux-terminal, ikke det native mirror fra cmux ssh-tmux. --session <name> vælger sessionen; øvrige flag matcher cmux mosh. Uden Mosh kører samme profil over SSH. Eksempel: cmux mosh-tmux dev@my-host cmux mosh-tmux dev@my-host --session agent-main
de: Verwendung: cmux mosh-tmux <destination> [--session <name>] [flags] Erstellt einen Mosh-Workspace, der eine benannte tmux-Sitzung erstellt oder anhängt (Standard: main). Das tmux-Profil bleibt bei Wiederverbindung und App-Sitzungswiederherstellung erhalten. Dies ist ein roamingfähiges tmux-Terminal, nicht der native Mirror von cmux ssh-tmux. --session <name> wählt die Sitzung; alle übrigen Optionen entsprechen cmux mosh. Ohne Mosh läuft dasselbe Profil über SSH. Beispiel: cmux mosh-tmux dev@my-host cmux mosh-tmux dev@my-host --session agent-main
es: Uso: cmux mosh-tmux <destination> [--session <name>] [flags] Crea un espacio Mosh que crea o adjunta una sesión tmux con nombre (predeterminada: main). El perfil tmux persiste al reconectar y restaurar la sesión de la app. Es un terminal tmux itinerante, no el espejo nativo de cmux ssh-tmux. --session <name> elige la sesión; las demás opciones coinciden con cmux mosh. Sin Mosh, el mismo perfil funciona por SSH. Ejemplo: cmux mosh-tmux dev@my-host cmux mosh-tmux dev@my-host --session agent-main
fr: Utilisation: cmux mosh-tmux <destination> [--session <name>] [flags] Crée un espace Mosh qui crée ou rejoint une session tmux nommée (par défaut : main). Le profil tmux persiste après reconnexion et restauration de session. Il s’agit d’un terminal tmux itinérant, pas du miroir natif de cmux ssh-tmux. --session <name> choisit la session ; les autres options correspondent à cmux mosh. Sans Mosh, le même profil passe par SSH. Exemple: cmux mosh-tmux dev@my-host cmux mosh-tmux dev@my-host --session agent-main
it: Utilizzo: cmux mosh-tmux <destination> [--session <name>] [flags] Crea un workspace Mosh che crea o collega una sessione tmux denominata (predefinita: main). Il profilo tmux persiste dopo riconnessione e ripristino della sessione dell’app. È un terminale tmux roaming, non il mirror nativo di cmux ssh-tmux. --session <name> sceglie la sessione; le altre opzioni corrispondono a cmux mosh. Senza Mosh, lo stesso profilo usa SSH. Esempio: cmux mosh-tmux dev@my-host cmux mosh-tmux dev@my-host --session agent-main
ja: 使用方法: cmux mosh-tmux <destination> [--session <name>] [flags] 名前付き tmux セッションを作成またはアタッチする Mosh ワークスペースを作成します（デフォルト: main）。tmux プロファイルは再接続とアプリセッション復元後も保持されます。これはローミング可能な tmux ターミナルであり、cmux ssh-tmux のネイティブミラーではありません。--session <name> でセッションを選び、その他のフラグは cmux mosh と同じです。Mosh がなければ同じプロファイルを SSH で実行します。 例: cmux mosh-tmux dev@my-host cmux mosh-tmux dev@my-host --session agent-main
ko: 사용법: cmux mosh-tmux <destination> [--session <name>] [flags] 이름 있는 tmux 세션을 만들거나 연결하는 Mosh 워크스페이스를 만듭니다(기본값: main). tmux 프로필은 재연결 및 앱 세션 복원 후에도 유지됩니다. 이는 로밍 tmux 터미널이며 cmux ssh-tmux의 네이티브 미러가 아닙니다. --session <name>으로 세션을 선택하며 나머지 플래그는 cmux mosh와 같습니다. Mosh가 없으면 같은 프로필을 SSH로 실행합니다. 예: cmux mosh-tmux dev@my-host cmux mosh-tmux dev@my-host --session agent-main
nb: Bruk: cmux mosh-tmux <destination> [--session <name>] [flags] Opprett et Mosh-arbeidsområde som oppretter eller kobler til en navngitt tmux-økt (standard: main). Tmux-profilen bevares ved ny tilkobling og gjenoppretting av appøkten. Dette er en roaming tmux-terminal, ikke det innebygde speilet fra cmux ssh-tmux. --session <name> velger økten; øvrige flagg samsvarer med cmux mosh. Uten Mosh kjører samme profil over SSH. Eksempel: cmux mosh-tmux dev@my-host cmux mosh-tmux dev@my-host --session agent-main
pl: Użycie: cmux mosh-tmux <destination> [--session <name>] [flags] Utwórz workspace Mosh, który tworzy lub dołącza do nazwanej sesji tmux (domyślnie: main). Profil tmux jest zachowywany po ponownym połączeniu i odtworzeniu sesji aplikacji. To terminal tmux z roamingiem, a nie natywne lustro z cmux ssh-tmux. --session <name> wybiera sesję; pozostałe flagi są takie jak w cmux mosh. Bez Mosh ten sam profil działa przez SSH. Przykład: cmux mosh-tmux dev@my-host cmux mosh-tmux dev@my-host --session agent-main
pt_br: Uso: cmux mosh-tmux <destination> [--session <name>] [flags] Crie um workspace Mosh que cria ou conecta uma sessão tmux nomeada (padrão: main). O perfil tmux persiste após reconexão e restauração da sessão do app. É um terminal tmux com roaming, não o espelho nativo de cmux ssh-tmux. --session <name> escolhe a sessão; as demais opções correspondem a cmux mosh. Sem Mosh, o mesmo perfil roda por SSH. Exemplo: cmux mosh-tmux dev@my-host cmux mosh-tmux dev@my-host --session agent-main
ru: Использование: cmux mosh-tmux <destination> [--session <name>] [flags] Создаёт Mosh-пространство, которое создаёт или подключает именованный сеанс tmux (по умолчанию: main). Профиль tmux сохраняется при переподключении и восстановлении сеанса приложения. Это роуминговый терминал tmux, а не нативное зеркало cmux ssh-tmux. --session <name> выбирает сеанс; остальные параметры совпадают с cmux mosh. Без Mosh тот же профиль работает через SSH. Пример: cmux mosh-tmux dev@my-host cmux mosh-tmux dev@my-host --session agent-main
th: การใช้งาน: cmux mosh-tmux <destination> [--session <name>] [flags] สร้าง Mosh workspace ที่สร้างหรือแนบ tmux session ที่มีชื่อ (ค่าเริ่มต้น: main) โปรไฟล์ tmux คงอยู่หลัง reconnect และ restore app session นี่คือ tmux terminal ที่ roaming ได้ ไม่ใช่ native mirror ของ cmux ssh-tmux ใช้ --session <name> เลือก session; แฟล็กอื่นเหมือน cmux mosh หากไม่มี Mosh โปรไฟล์เดิมจะทำงานผ่าน SSH ตัวอย่าง: cmux mosh-tmux dev@my-host cmux mosh-tmux dev@my-host --session agent-main
tr: Kullanım: cmux mosh-tmux <destination> [--session <name>] [flags] Adlandırılmış bir tmux oturumu oluşturan veya ona bağlanan Mosh çalışma alanı oluşturur (varsayılan: main). tmux profili yeniden bağlanma ve uygulama oturumu geri yüklemesinde korunur. Bu, dolaşabilen bir tmux terminalidir; cmux ssh-tmux yerel aynası değildir. --session <name> oturumu seçer; diğer bayraklar cmux mosh ile aynıdır. Mosh yoksa aynı profil SSH üzerinden çalışır. Örnek: cmux mosh-tmux dev@my-host cmux mosh-tmux dev@my-host --session agent-main
uk: Використання: cmux mosh-tmux <destination> [--session <name>] [flags] Створює Mosh-простір, який створює або приєднує іменований сеанс tmux (типово: main). Профіль tmux зберігається після перепідключення й відновлення сеансу програми. Це роумінговий термінал tmux, а не нативне дзеркало cmux ssh-tmux. --session <name> вибирає сеанс; решта параметрів відповідає cmux mosh. Без Mosh той самий профіль працює через SSH. Приклад: cmux mosh-tmux dev@my-host cmux mosh-tmux dev@my-host --session agent-main
zh_hans: 用法: cmux mosh-tmux <destination> [--session <name>] [flags] 创建一个 Mosh 工作区，用于创建或附加命名的 tmux 会话（默认：main）。tmux 配置会在重连和应用会话恢复后保留。这是可漫游的 tmux 终端，而不是 cmux ssh-tmux 的原生镜像。--session <name> 选择会话；其他选项与 cmux mosh 相同。没有 Mosh 时，同一配置会通过 SSH 运行。 示例: cmux mosh-tmux dev@my-host cmux mosh-tmux dev@my-host --session agent-main
zh_hant: 用法: cmux mosh-tmux <destination> [--session <name>] [flags] 建立 Mosh 工作區，用來建立或附加具名 tmux 工作階段（預設：main）。tmux 設定會在重新連線與 App 工作階段還原後保留。這是可漫遊的 tmux 終端，而不是 cmux ssh-tmux 的原生鏡像。--session <name> 選擇工作階段；其他選項與 cmux mosh 相同。沒有 Mosh 時，同一設定會透過 SSH 執行。 範例: cmux mosh-tmux dev@my-host cmux mosh-tmux dev@my-host --session agent-main

# cli.help.openNotification
source: Usage: cmux open-notification --id <uuid> Focus the notification's workspace and surface, then mark the row read. Flags: --id <uuid> Notification id to open --json Print JSON --id-format <mode> refs, uuids, or both
ar: الاستخدام: cmux open-notification --id <uuid> التركيز على مساحة عمل الإشعار وسطحه، ثم وضع علامة مقروء على الصف. الخيارات: --id <uuid> معرف الإشعار المراد فتحه --json طباعة بتنسيق JSON --id-format <mode> refs، أو uuids، أو كلاهما
de: Verwendung: cmux open-notification --id <uuid> Fokussiert den Arbeitsbereich und die Oberfläche der Benachrichtigung und markiert die Zeile dann als gelesen. Flags: --id <uuid> Zu öffnende Benachrichtigungs-ID --json JSON ausgeben --id-format <mode> refs, uuids oder beides
es: Uso: cmux open-notification --id <uuid> Enfoca el espacio de trabajo y la superficie de la notificación, luego marca la fila como leída. Opciones: --id <uuid> Id de notificación a abrir --json Muestra JSON --id-format <mode> refs, uuids o ambos
fr: Utilisation : cmux open-notification --id <uuid> Cible l'espace de travail et la surface d’affichage de la notification, puis marque la ligne comme lue. Options : --id <uuid> ID de la notification à ouvrir --json Affiche le JSON --id-format <mode> refs, uuids ou both
ja: Usage: cmux open-notification --id <uuid> 通知のワークスペースとサーフェスへフォーカスし、その行を既読にします。 Flags: --id <uuid> 開く通知 ID --json JSON を出力 --id-format <mode> refs、uuids、both のいずれか
ko: 사용법: cmux open-notification --id <uuid> 알림의 작업 공간 및 화면으로 포커스를 맞추고 해당 행을 읽음으로 표시합니다. 플래그: --id <uuid> 열 알림 ID --json JSON 출력 --id-format <mode> refs, uuids 또는 둘 다
zh_hans: 用法：cmux open-notification --id <uuid> 聚焦该通知所属的工作区和表面，然后将该行标记为已读。 标志: --id <uuid> 要打开的通知 id --json 输出 JSON --id-format <mode> refs、uuids 或 both
zh_hant: 用法：cmux open-notification --id <uuid> 聚焦該通知的工作區和介面，然後將該列標記為已讀。 旗標： --id <uuid> 要開啟的通知識別碼 --json 列印 JSON --id-format <mode> refs、uuids 或兩者皆是
